tap 'homebrew/bundle'
tap 'homebrew/core'
brew 'bash-completion'
brew 'popt'
brew 'librsync'
brew 'openssl'
brew 'duplicity'
brew 'gdbm'
brew 'git'
brew 'libevent'
brew 'libyaml'
brew 'perl'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'ruby'
brew 'tmux'
brew 'vim'
