tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
# GNU database manager
brew "gdbm"
# YAML Parser
brew "libyaml"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Emacs dependency management
brew "cask"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# Configurable static site generator
brew "hugo"
# Asynchronous event library
brew "libevent"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Library that implements the rsync remote-delta algorithm
brew "librsync"
# Highly capable, feature-rich programming language
brew "perl"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
cask "1password"
cask "alfred"
cask "alinof-timer"
cask "android-file-transfer"
cask "caffeine"
cask "filezilla"
cask "firefox"
cask "gimp"
cask "gitbook-editor"
cask "google-chrome"
cask "iterm2"
cask "skype"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "synology-drive"
cask "vagrant"
cask "virtualbox"
cask "vlc"
