##
# Brewfile by Sebastian Thiele
# based on https://github.com/joelparkerhenderson/brewfile/blob/master/Brewfile
#
# ## Taps
tap 'homebrew/bundle'
tap 'homebrew/core'

##
# Browsers
##

# Google Chrome web browser
cask 'google-chrome'

# Firefox web browser
cask 'firefox'

##
# Terminals
##

# iTerm
cask 'iterm2'

# tmux
brew 'tmux'

##
# Shells
##

# Programmable completion functions for bash
brew 'bash-completion'


##
# Editors
##

# Vim
brew 'vim'

# Sublime text editor
cask 'sublime-text'

# Gitbooks Editor
cask 'gitbook-editor'

##
# Downloaders
##

# Homebrew Cask extends Homebrew to install OS X applications and large binaries.
brew 'cask'

# curl is a command line tool for transferring data with URL syntax
brew 'curl'

# Wget is a free software package for retrieving files using HTTP and FTP.
brew 'wget'

##
# Version control
##

# git
brew 'git'

# SourceTree graphic client for git
cask 'sourcetree'

##
# System related
##

# rsync
brew 'librsync'

# openssl
brew 'openssl'

##
# Produktivity
##

# Alfred
cask 'alfred'

# VLC media player
cask 'vlc'

# Spotify
cask 'spotify'

# Spectacle
cask 'spectacle'

# Caffeine
cask 'caffeine'

# 1 password
cask '1password'

# Alinof-Timer
# Timer App
cask 'alinof-timer'

cask "android-file-transfer"

cask "skype"

##
# Development
##

brew 'popt'
brew 'gdbm'
brew 'libevent'
brew 'libyaml'
brew 'perl'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'ruby'
cask 'vagrant'
cask 'virtualbox'
